espressif/esp-idf/components/soc/esp32/register/soc/sdio_slc_host_reg.h
/*
 * SPDX-FileCopyrightText: 2015-2025 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#ifndef _SOC_HOST_REG_H_
#define _SOC_HOST_REG_H_


#include "soc/soc.h"
#define HOST_SLCHOST_FUNC2_0_REG          (DR_REG_SLCHOST_BASE + 0x10)
/* HOST_SLC_FUNC2_INT : R/W ;bitpos:[24] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC_FUNC2_INT  (BIT(24))
#define HOST_SLC_FUNC2_INT_M  (BIT(24))
#define HOST_SLC_FUNC2_INT_V  0x1
#define HOST_SLC_FUNC2_INT_S  24

#define HOST_SLCHOST_FUNC2_1_REG          (DR_REG_SLCHOST_BASE + 0x14)
/* HOST_SLC_FUNC2_INT_EN : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC_FUNC2_INT_EN  (BIT(0))
#define HOST_SLC_FUNC2_INT_EN_M  (BIT(0))
#define HOST_SLC_FUNC2_INT_EN_V  0x1
#define HOST_SLC_FUNC2_INT_EN_S  0

#define HOST_SLCHOST_FUNC2_2_REG          (DR_REG_SLCHOST_BASE + 0x20)
/* HOST_SLC_FUNC1_MDSTAT : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: */
#define HOST_SLC_FUNC1_MDSTAT  (BIT(0))
#define HOST_SLC_FUNC1_MDSTAT_M  (BIT(0))
#define HOST_SLC_FUNC1_MDSTAT_V  0x1
#define HOST_SLC_FUNC1_MDSTAT_S  0

#define HOST_SLCHOST_GPIO_STATUS0_REG          (DR_REG_SLCHOST_BASE + 0x34)
/* HOST_GPIO_SDIO_INT0 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: */
#define HOST_GPIO_SDIO_INT0  0xFFFFFFFF
#define HOST_GPIO_SDIO_INT0_M  ((HOST_GPIO_SDIO_INT0_V)<<(HOST_GPIO_SDIO_INT0_S))
#define HOST_GPIO_SDIO_INT0_V  0xFFFFFFFF
#define HOST_GPIO_SDIO_INT0_S  0

#define HOST_SLCHOST_GPIO_STATUS1_REG          (DR_REG_SLCHOST_BASE + 0x38)
/* HOST_GPIO_SDIO_INT1 : RO ;bitpos:[7:0] ;default: 8'b0 ; */
/*description: */
#define HOST_GPIO_SDIO_INT1  0x000000FF
#define HOST_GPIO_SDIO_INT1_M  ((HOST_GPIO_SDIO_INT1_V)<<(HOST_GPIO_SDIO_INT1_S))
#define HOST_GPIO_SDIO_INT1_V  0xFF
#define HOST_GPIO_SDIO_INT1_S  0

#define HOST_SLCHOST_GPIO_IN0_REG          (DR_REG_SLCHOST_BASE + 0x3C)
/* HOST_GPIO_SDIO_IN0 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: */
#define HOST_GPIO_SDIO_IN0  0xFFFFFFFF
#define HOST_GPIO_SDIO_IN0_M  ((HOST_GPIO_SDIO_IN0_V)<<(HOST_GPIO_SDIO_IN0_S))
#define HOST_GPIO_SDIO_IN0_V  0xFFFFFFFF
#define HOST_GPIO_SDIO_IN0_S  0

#define HOST_SLCHOST_GPIO_IN1_REG          (DR_REG_SLCHOST_BASE + 0x40)
/* HOST_GPIO_SDIO_IN1 : RO ;bitpos:[7:0] ;default: 8'b0 ; */
/*description: */
#define HOST_GPIO_SDIO_IN1  0x000000FF
#define HOST_GPIO_SDIO_IN1_M  ((HOST_GPIO_SDIO_IN1_V)<<(HOST_GPIO_SDIO_IN1_S))
#define HOST_GPIO_SDIO_IN1_V  0xFF
#define HOST_GPIO_SDIO_IN1_S  0

#define HOST_SLC0HOST_TOKEN_RDATA_REG          (DR_REG_SLCHOST_BASE + 0x44)
/* HOST_SLC0_RX_PF_EOF : RO ;bitpos:[31:28] ;default: 4'h0 ; */
/*description: */
#define HOST_SLC0_RX_PF_EOF  0x0000000F
#define HOST_SLC0_RX_PF_EOF_M  ((HOST_SLC0_RX_PF_EOF_V)<<(HOST_SLC0_RX_PF_EOF_S))
#define HOST_SLC0_RX_PF_EOF_V  0xF
#define HOST_SLC0_RX_PF_EOF_S  28
/* HOST_HOSTSLC0_TOKEN1 : RO ;bitpos:[27:16] ;default: 12'h0 ; */
/*description: */
#define HOST_HOSTSLC0_TOKEN1  0x00000FFF
#define HOST_HOSTSLC0_TOKEN1_M  ((HOST_HOSTSLC0_TOKEN1_V)<<(HOST_HOSTSLC0_TOKEN1_S))
#define HOST_HOSTSLC0_TOKEN1_V  0xFFF
#define HOST_HOSTSLC0_TOKEN1_S  16
/* HOST_SLC0_RX_PF_VALID : RO ;bitpos:[12] ;default: 4'h0 ; */
/*description: */
#define HOST_SLC0_RX_PF_VALID  (BIT(12))
#define HOST_SLC0_RX_PF_VALID_M  (BIT(12))
#define HOST_SLC0_RX_PF_VALID_V  0x1
#define HOST_SLC0_RX_PF_VALID_S  12
/* HOST_SLC0_TOKEN0 : RO ;bitpos:[11:0] ;default: 12'h0 ; */
/*description: */
#define HOST_SLC0_TOKEN0  0x00000FFF
#define HOST_SLC0_TOKEN0_M  ((HOST_SLC0_TOKEN0_V)<<(HOST_SLC0_TOKEN0_S))
#define HOST_SLC0_TOKEN0_V  0xFFF
#define HOST_SLC0_TOKEN0_S  0

#define HOST_SLC0_HOST_PF_REG          (DR_REG_SLCHOST_BASE + 0x48)
/* HOST_SLC0_PF_DATA : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define HOST_SLC0_PF_DATA  0xFFFFFFFF
#define HOST_SLC0_PF_DATA_M  ((HOST_SLC0_PF_DATA_V)<<(HOST_SLC0_PF_DATA_S))
#define HOST_SLC0_PF_DATA_V  0xFFFFFFFF
#define HOST_SLC0_PF_DATA_S  0

#define HOST_SLC1_HOST_PF_REG          (DR_REG_SLCHOST_BASE + 0x4C)
/* HOST_SLC1_PF_DATA : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define HOST_SLC1_PF_DATA  0xFFFFFFFF
#define HOST_SLC1_PF_DATA_M  ((HOST_SLC1_PF_DATA_V)<<(HOST_SLC1_PF_DATA_S))
#define HOST_SLC1_PF_DATA_V  0xFFFFFFFF
#define HOST_SLC1_PF_DATA_S  0

#define HOST_SLC0HOST_INT_RAW_REG          (DR_REG_SLCHOST_BASE + 0x50)
/* HOST_GPIO_SDIO_INT_RAW : RO ;bitpos:[25] ;default: 1'b0 ; */
/*description: */
#define HOST_GPIO_SDIO_INT_RAW  (BIT(25))
#define HOST_GPIO_SDIO_INT_RAW_M  (BIT(25))
#define HOST_GPIO_SDIO_INT_RAW_V  0x1
#define HOST_GPIO_SDIO_INT_RAW_S  25
/* HOST_SLC0_HOST_RD_RETRY_INT_RAW : RO ;bitpos:[24] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_HOST_RD_RETRY_INT_RAW  (BIT(24))
#define HOST_SLC0_HOST_RD_RETRY_INT_RAW_M  (BIT(24))
#define HOST_SLC0_HOST_RD_RETRY_INT_RAW_V  0x1
#define HOST_SLC0_HOST_RD_RETRY_INT_RAW_S  24
/* HOST_SLC0_RX_NEW_PACKET_INT_RAW : RO ;bitpos:[23] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_RX_NEW_PACKET_INT_RAW  (BIT(23))
#define HOST_SLC0_RX_NEW_PACKET_INT_RAW_M  (BIT(23))
#define HOST_SLC0_RX_NEW_PACKET_INT_RAW_V  0x1
#define HOST_SLC0_RX_NEW_PACKET_INT_RAW_S  23
/* HOST_SLC0_EXT_BIT3_INT_RAW : RO ;bitpos:[22] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_EXT_BIT3_INT_RAW  (BIT(22))
#define HOST_SLC0_EXT_BIT3_INT_RAW_M  (BIT(22))
#define HOST_SLC0_EXT_BIT3_INT_RAW_V  0x1
#define HOST_SLC0_EXT_BIT3_INT_RAW_S  22
/* HOST_SLC0_EXT_BIT2_INT_RAW : RO ;bitpos:[21] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_EXT_BIT2_INT_RAW  (BIT(21))
#define HOST_SLC0_EXT_BIT2_INT_RAW_M  (BIT(21))
#define HOST_SLC0_EXT_BIT2_INT_RAW_V  0x1
#define HOST_SLC0_EXT_BIT2_INT_RAW_S  21
/* HOST_SLC0_EXT_BIT1_INT_RAW : RO ;bitpos:[20] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_EXT_BIT1_INT_RAW  (BIT(20))
#define HOST_SLC0_EXT_BIT1_INT_RAW_M  (BIT(20))
#define HOST_SLC0_EXT_BIT1_INT_RAW_V  0x1
#define HOST_SLC0_EXT_BIT1_INT_RAW_S  20
/* HOST_SLC0_EXT_BIT0_INT_RAW : RO ;bitpos:[19] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_EXT_BIT0_INT_RAW  (BIT(19))
#define HOST_SLC0_EXT_BIT0_INT_RAW_M  (BIT(19))
#define HOST_SLC0_EXT_BIT0_INT_RAW_V  0x1
#define HOST_SLC0_EXT_BIT0_INT_RAW_S  19
/* HOST_SLC0_RX_PF_VALID_INT_RAW : RO ;bitpos:[18] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_RX_PF_VALID_INT_RAW  (BIT(18))
#define HOST_SLC0_RX_PF_VALID_INT_RAW_M  (BIT(18))
#define HOST_SLC0_RX_PF_VALID_INT_RAW_V  0x1
#define HOST_SLC0_RX_PF_VALID_INT_RAW_S  18
/* HOST_SLC0_TX_OVF_INT_RAW : RO ;bitpos:[17] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TX_OVF_INT_RAW  (BIT(17))
#define HOST_SLC0_TX_OVF_INT_RAW_M  (BIT(17))
#define HOST_SLC0_TX_OVF_INT_RAW_V  0x1
#define HOST_SLC0_TX_OVF_INT_RAW_S  17
/* HOST_SLC0_RX_UDF_INT_RAW : RO ;bitpos:[16] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_RX_UDF_INT_RAW  (BIT(16))
#define HOST_SLC0_RX_UDF_INT_RAW_M  (BIT(16))
#define HOST_SLC0_RX_UDF_INT_RAW_V  0x1
#define HOST_SLC0_RX_UDF_INT_RAW_S  16
/* HOST_SLC0HOST_TX_START_INT_RAW : RO ;bitpos:[15] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0HOST_TX_START_INT_RAW  (BIT(15))
#define HOST_SLC0HOST_TX_START_INT_RAW_M  (BIT(15))
#define HOST_SLC0HOST_TX_START_INT_RAW_V  0x1
#define HOST_SLC0HOST_TX_START_INT_RAW_S  15
/* HOST_SLC0HOST_RX_START_INT_RAW : RO ;bitpos:[14] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0HOST_RX_START_INT_RAW  (BIT(14))
#define HOST_SLC0HOST_RX_START_INT_RAW_M  (BIT(14))
#define HOST_SLC0HOST_RX_START_INT_RAW_V  0x1
#define HOST_SLC0HOST_RX_START_INT_RAW_S  14
/* HOST_SLC0HOST_RX_EOF_INT_RAW : RO ;bitpos:[13] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0HOST_RX_EOF_INT_RAW  (BIT(13))
#define HOST_SLC0HOST_RX_EOF_INT_RAW_M  (BIT(13))
#define HOST_SLC0HOST_RX_EOF_INT_RAW_V  0x1
#define HOST_SLC0HOST_RX_EOF_INT_RAW_S  13
/* HOST_SLC0HOST_RX_SOF_INT_RAW : RO ;bitpos:[12] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0HOST_RX_SOF_INT_RAW  (BIT(12))
#define HOST_SLC0HOST_RX_SOF_INT_RAW_M  (BIT(12))
#define HOST_SLC0HOST_RX_SOF_INT_RAW_V  0x1
#define HOST_SLC0HOST_RX_SOF_INT_RAW_S  12
/* HOST_SLC0_TOKEN1_0TO1_INT_RAW : RO ;bitpos:[11] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOKEN1_0TO1_INT_RAW  (BIT(11))
#define HOST_SLC0_TOKEN1_0TO1_INT_RAW_M  (BIT(11))
#define HOST_SLC0_TOKEN1_0TO1_INT_RAW_V  0x1
#define HOST_SLC0_TOKEN1_0TO1_INT_RAW_S  11
/* HOST_SLC0_TOKEN0_0TO1_INT_RAW : RO ;bitpos:[10] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOKEN0_0TO1_INT_RAW  (BIT(10))
#define HOST_SLC0_TOKEN0_0TO1_INT_RAW_M  (BIT(10))
#define HOST_SLC0_TOKEN0_0TO1_INT_RAW_V  0x1
#define HOST_SLC0_TOKEN0_0TO1_INT_RAW_S  10
/* HOST_SLC0_TOKEN1_1TO0_INT_RAW : RO ;bitpos:[9] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOKEN1_1TO0_INT_RAW  (BIT(9))
#define HOST_SLC0_TOKEN1_1TO0_INT_RAW_M  (BIT(9))
#define HOST_SLC0_TOKEN1_1TO0_INT_RAW_V  0x1
#define HOST_SLC0_TOKEN1_1TO0_INT_RAW_S  9
/* HOST_SLC0_TOKEN0_1TO0_INT_RAW : RO ;bitpos:[8] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOKEN0_1TO0_INT_RAW  (BIT(8))
#define HOST_SLC0_TOKEN0_1TO0_INT_RAW_M  (BIT(8))
#define HOST_SLC0_TOKEN0_1TO0_INT_RAW_V  0x1
#define HOST_SLC0_TOKEN0_1TO0_INT_RAW_S  8
/* HOST_SLC0_TOHOST_BIT7_INT_RAW : RO ;bitpos:[7] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOHOST_BIT7_INT_RAW  (BIT(7))
#define HOST_SLC0_TOHOST_BIT7_INT_RAW_M  (BIT(7))
#define HOST_SLC0_TOHOST_BIT7_INT_RAW_V  0x1
#define HOST_SLC0_TOHOST_BIT7_INT_RAW_S  7
/* HOST_SLC0_TOHOST_BIT6_INT_RAW : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOHOST_BIT6_INT_RAW  (BIT(6))
#define HOST_SLC0_TOHOST_BIT6_INT_RAW_M  (BIT(6))
#define HOST_SLC0_TOHOST_BIT6_INT_RAW_V  0x1
#define HOST_SLC0_TOHOST_BIT6_INT_RAW_S  6
/* HOST_SLC0_TOHOST_BIT5_INT_RAW : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOHOST_BIT5_INT_RAW  (BIT(5))
#define HOST_SLC0_TOHOST_BIT5_INT_RAW_M  (BIT(5))
#define HOST_SLC0_TOHOST_BIT5_INT_RAW_V  0x1
#define HOST_SLC0_TOHOST_BIT5_INT_RAW_S  5
/* HOST_SLC0_TOHOST_BIT4_INT_RAW : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOHOST_BIT4_INT_RAW  (BIT(4))
#define HOST_SLC0_TOHOST_BIT4_INT_RAW_M  (BIT(4))
#define HOST_SLC0_TOHOST_BIT4_INT_RAW_V  0x1
#define HOST_SLC0_TOHOST_BIT4_INT_RAW_S  4
/* HOST_SLC0_TOHOST_BIT3_INT_RAW : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOHOST_BIT3_INT_RAW  (BIT(3))
#define HOST_SLC0_TOHOST_BIT3_INT_RAW_M  (BIT(3))
#define HOST_SLC0_TOHOST_BIT3_INT_RAW_V  0x1
#define HOST_SLC0_TOHOST_BIT3_INT_RAW_S  3
/* HOST_SLC0_TOHOST_BIT2_INT_RAW : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOHOST_BIT2_INT_RAW  (BIT(2))
#define HOST_SLC0_TOHOST_BIT2_INT_RAW_M  (BIT(2))
#define HOST_SLC0_TOHOST_BIT2_INT_RAW_V  0x1
#define HOST_SLC0_TOHOST_BIT2_INT_RAW_S  2
/* HOST_SLC0_TOHOST_BIT1_INT_RAW : RO ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOHOST_BIT1_INT_RAW  (BIT(1))
#define HOST_SLC0_TOHOST_BIT1_INT_RAW_M  (BIT(1))
#define HOST_SLC0_TOHOST_BIT1_INT_RAW_V  0x1
#define HOST_SLC0_TOHOST_BIT1_INT_RAW_S  1
/* HOST_SLC0_TOHOST_BIT0_INT_RAW : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOHOST_BIT0_INT_RAW  (BIT(0))
#define HOST_SLC0_TOHOST_BIT0_INT_RAW_M  (BIT(0))
#define HOST_SLC0_TOHOST_BIT0_INT_RAW_V  0x1
#define HOST_SLC0_TOHOST_BIT0_INT_RAW_S  0

