espressif/esp-idf/components/soc/esp32/register/soc/sdio_slc_host_reg.h
#define HOST_SLC0HOST_FUNC2_INT_ENA_REG          (DR_REG_SLCHOST_BASE + 0xE4)
/* HOST_FN2_GPIO_SDIO_INT_ENA : R/W ;bitpos:[25] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_GPIO_SDIO_INT_ENA  (BIT(25))
#define HOST_FN2_GPIO_SDIO_INT_ENA_M  (BIT(25))
#define HOST_FN2_GPIO_SDIO_INT_ENA_V  0x1
#define HOST_FN2_GPIO_SDIO_INT_ENA_S  25
/* HOST_FN2_SLC0_HOST_RD_RETRY_INT_ENA : R/W ;bitpos:[24] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_SLC0_HOST_RD_RETRY_INT_ENA  (BIT(24))
#define HOST_FN2_SLC0_HOST_RD_RETRY_INT_ENA_M  (BIT(24))
#define HOST_FN2_SLC0_HOST_RD_RETRY_INT_ENA_V  0x1
#define HOST_FN2_SLC0_HOST_RD_RETRY_INT_ENA_S  24
/* HOST_FN2_SLC0_RX_NEW_PACKET_INT_ENA : R/W ;bitpos:[23] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_SLC0_RX_NEW_PACKET_INT_ENA  (BIT(23))
#define HOST_FN2_SLC0_RX_NEW_PACKET_INT_ENA_M  (BIT(23))
#define HOST_FN2_SLC0_RX_NEW_PACKET_INT_ENA_V  0x1
#define HOST_FN2_SLC0_RX_NEW_PACKET_INT_ENA_S  23
/* HOST_FN2_SLC0_EXT_BIT3_INT_ENA : R/W ;bitpos:[22] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_SLC0_EXT_BIT3_INT_ENA  (BIT(22))
#define HOST_FN2_SLC0_EXT_BIT3_INT_ENA_M  (BIT(22))
#define HOST_FN2_SLC0_EXT_BIT3_INT_ENA_V  0x1
#define HOST_FN2_SLC0_EXT_BIT3_INT_ENA_S  22
/* HOST_FN2_SLC0_EXT_BIT2_INT_ENA : R/W ;bitpos:[21] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_SLC0_EXT_BIT2_INT_ENA  (BIT(21))
#define HOST_FN2_SLC0_EXT_BIT2_INT_ENA_M  (BIT(21))
#define HOST_FN2_SLC0_EXT_BIT2_INT_ENA_V  0x1
#define HOST_FN2_SLC0_EXT_BIT2_INT_ENA_S  21
/* HOST_FN2_SLC0_EXT_BIT1_INT_ENA : R/W ;bitpos:[20] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_SLC0_EXT_BIT1_INT_ENA  (BIT(20))
#define HOST_FN2_SLC0_EXT_BIT1_INT_ENA_M  (BIT(20))
#define HOST_FN2_SLC0_EXT_BIT1_INT_ENA_V  0x1
#define HOST_FN2_SLC0_EXT_BIT1_INT_ENA_S  20
/* HOST_FN2_SLC0_EXT_BIT0_INT_ENA : R/W ;bitpos:[19] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_SLC0_EXT_BIT0_INT_ENA  (BIT(19))
#define HOST_FN2_SLC0_EXT_BIT0_INT_ENA_M  (BIT(19))
#define HOST_FN2_SLC0_EXT_BIT0_INT_ENA_V  0x1
#define HOST_FN2_SLC0_EXT_BIT0_INT_ENA_S  19
/* HOST_FN2_SLC0_RX_PF_VALID_INT_ENA : R/W ;bitpos:[18] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_SLC0_RX_PF_VALID_INT_ENA  (BIT(18))
#define HOST_FN2_SLC0_RX_PF_VALID_INT_ENA_M  (BIT(18))
#define HOST_FN2_SLC0_RX_PF_VALID_INT_ENA_V  0x1
#define HOST_FN2_SLC0_RX_PF_VALID_INT_ENA_S  18
/* HOST_FN2_SLC0_TX_OVF_INT_ENA : R/W ;bitpos:[17] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_SLC0_TX_OVF_INT_ENA  (BIT(17))
#define HOST_FN2_SLC0_TX_OVF_INT_ENA_M  (BIT(17))
#define HOST_FN2_SLC0_TX_OVF_INT_ENA_V  0x1
#define HOST_FN2_SLC0_TX_OVF_INT_ENA_S  17
/* HOST_FN2_SLC0_RX_UDF_INT_ENA : R/W ;bitpos:[16] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_SLC0_RX_UDF_INT_ENA  (BIT(16))
#define HOST_FN2_SLC0_RX_UDF_INT_ENA_M  (BIT(16))
#define HOST_FN2_SLC0_RX_UDF_INT_ENA_V  0x1
#define HOST_FN2_SLC0_RX_UDF_INT_ENA_S  16
/* HOST_FN2_SLC0HOST_TX_START_INT_ENA : R/W ;bitpos:[15] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_SLC0HOST_TX_START_INT_ENA  (BIT(15))
#define HOST_FN2_SLC0HOST_TX_START_INT_ENA_M  (BIT(15))
#define HOST_FN2_SLC0HOST_TX_START_INT_ENA_V  0x1
#define HOST_FN2_SLC0HOST_TX_START_INT_ENA_S  15
/* HOST_FN2_SLC0HOST_RX_START_INT_ENA : R/W ;bitpos:[14] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_SLC0HOST_RX_START_INT_ENA  (BIT(14))
#define HOST_FN2_SLC0HOST_RX_START_INT_ENA_M  (BIT(14))
#define HOST_FN2_SLC0HOST_RX_START_INT_ENA_V  0x1
#define HOST_FN2_SLC0HOST_RX_START_INT_ENA_S  14
/* HOST_FN2_SLC0HOST_RX_EOF_INT_ENA : R/W ;bitpos:[13] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_SLC0HOST_RX_EOF_INT_ENA  (BIT(13))
#define HOST_FN2_SLC0HOST_RX_EOF_INT_ENA_M  (BIT(13))
#define HOST_FN2_SLC0HOST_RX_EOF_INT_ENA_V  0x1
#define HOST_FN2_SLC0HOST_RX_EOF_INT_ENA_S  13
/* HOST_FN2_SLC0HOST_RX_SOF_INT_ENA : R/W ;bitpos:[12] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_SLC0HOST_RX_SOF_INT_ENA  (BIT(12))
#define HOST_FN2_SLC0HOST_RX_SOF_INT_ENA_M  (BIT(12))
#define HOST_FN2_SLC0HOST_RX_SOF_INT_ENA_V  0x1
#define HOST_FN2_SLC0HOST_RX_SOF_INT_ENA_S  12
/* HOST_FN2_SLC0_TOKEN1_0TO1_INT_ENA : R/W ;bitpos:[11] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_SLC0_TOKEN1_0TO1_INT_ENA  (BIT(11))
#define HOST_FN2_SLC0_TOKEN1_0TO1_INT_ENA_M  (BIT(11))
#define HOST_FN2_SLC0_TOKEN1_0TO1_INT_ENA_V  0x1
#define HOST_FN2_SLC0_TOKEN1_0TO1_INT_ENA_S  11
/* HOST_FN2_SLC0_TOKEN0_0TO1_INT_ENA : R/W ;bitpos:[10] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_SLC0_TOKEN0_0TO1_INT_ENA  (BIT(10))
#define HOST_FN2_SLC0_TOKEN0_0TO1_INT_ENA_M  (BIT(10))
#define HOST_FN2_SLC0_TOKEN0_0TO1_INT_ENA_V  0x1
#define HOST_FN2_SLC0_TOKEN0_0TO1_INT_ENA_S  10
/* HOST_FN2_SLC0_TOKEN1_1TO0_INT_ENA : R/W ;bitpos:[9] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_SLC0_TOKEN1_1TO0_INT_ENA  (BIT(9))
#define HOST_FN2_SLC0_TOKEN1_1TO0_INT_ENA_M  (BIT(9))
#define HOST_FN2_SLC0_TOKEN1_1TO0_INT_ENA_V  0x1
#define HOST_FN2_SLC0_TOKEN1_1TO0_INT_ENA_S  9
/* HOST_FN2_SLC0_TOKEN0_1TO0_INT_ENA : R/W ;bitpos:[8] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_SLC0_TOKEN0_1TO0_INT_ENA  (BIT(8))
#define HOST_FN2_SLC0_TOKEN0_1TO0_INT_ENA_M  (BIT(8))
#define HOST_FN2_SLC0_TOKEN0_1TO0_INT_ENA_V  0x1
#define HOST_FN2_SLC0_TOKEN0_1TO0_INT_ENA_S  8
/* HOST_FN2_SLC0_TOHOST_BIT7_INT_ENA : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_SLC0_TOHOST_BIT7_INT_ENA  (BIT(7))
#define HOST_FN2_SLC0_TOHOST_BIT7_INT_ENA_M  (BIT(7))
#define HOST_FN2_SLC0_TOHOST_BIT7_INT_ENA_V  0x1
#define HOST_FN2_SLC0_TOHOST_BIT7_INT_ENA_S  7
/* HOST_FN2_SLC0_TOHOST_BIT6_INT_ENA : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_SLC0_TOHOST_BIT6_INT_ENA  (BIT(6))
#define HOST_FN2_SLC0_TOHOST_BIT6_INT_ENA_M  (BIT(6))
#define HOST_FN2_SLC0_TOHOST_BIT6_INT_ENA_V  0x1
#define HOST_FN2_SLC0_TOHOST_BIT6_INT_ENA_S  6
/* HOST_FN2_SLC0_TOHOST_BIT5_INT_ENA : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_SLC0_TOHOST_BIT5_INT_ENA  (BIT(5))
#define HOST_FN2_SLC0_TOHOST_BIT5_INT_ENA_M  (BIT(5))
#define HOST_FN2_SLC0_TOHOST_BIT5_INT_ENA_V  0x1
#define HOST_FN2_SLC0_TOHOST_BIT5_INT_ENA_S  5
/* HOST_FN2_SLC0_TOHOST_BIT4_INT_ENA : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_SLC0_TOHOST_BIT4_INT_ENA  (BIT(4))
#define HOST_FN2_SLC0_TOHOST_BIT4_INT_ENA_M  (BIT(4))
#define HOST_FN2_SLC0_TOHOST_BIT4_INT_ENA_V  0x1
#define HOST_FN2_SLC0_TOHOST_BIT4_INT_ENA_S  4
/* HOST_FN2_SLC0_TOHOST_BIT3_INT_ENA : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_SLC0_TOHOST_BIT3_INT_ENA  (BIT(3))
#define HOST_FN2_SLC0_TOHOST_BIT3_INT_ENA_M  (BIT(3))
#define HOST_FN2_SLC0_TOHOST_BIT3_INT_ENA_V  0x1
#define HOST_FN2_SLC0_TOHOST_BIT3_INT_ENA_S  3
/* HOST_FN2_SLC0_TOHOST_BIT2_INT_ENA : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_SLC0_TOHOST_BIT2_INT_ENA  (BIT(2))
#define HOST_FN2_SLC0_TOHOST_BIT2_INT_ENA_M  (BIT(2))
#define HOST_FN2_SLC0_TOHOST_BIT2_INT_ENA_V  0x1
#define HOST_FN2_SLC0_TOHOST_BIT2_INT_ENA_S  2
/* HOST_FN2_SLC0_TOHOST_BIT1_INT_ENA : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_SLC0_TOHOST_BIT1_INT_ENA  (BIT(1))
#define HOST_FN2_SLC0_TOHOST_BIT1_INT_ENA_M  (BIT(1))
#define HOST_FN2_SLC0_TOHOST_BIT1_INT_ENA_V  0x1
#define HOST_FN2_SLC0_TOHOST_BIT1_INT_ENA_S  1
/* HOST_FN2_SLC0_TOHOST_BIT0_INT_ENA : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_SLC0_TOHOST_BIT0_INT_ENA  (BIT(0))
#define HOST_FN2_SLC0_TOHOST_BIT0_INT_ENA_M  (BIT(0))
#define HOST_FN2_SLC0_TOHOST_BIT0_INT_ENA_V  0x1
#define HOST_FN2_SLC0_TOHOST_BIT0_INT_ENA_S  0

#define HOST_SLC1HOST_FUNC2_INT_ENA_REG          (DR_REG_SLCHOST_BASE + 0xE8)
/* HOST_FN2_SLC1_BT_RX_NEW_PACKET_INT_ENA : R/W ;bitpos:[25] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_SLC1_BT_RX_NEW_PACKET_INT_ENA  (BIT(25))
#define HOST_FN2_SLC1_BT_RX_NEW_PACKET_INT_ENA_M  (BIT(25))
#define HOST_FN2_SLC1_BT_RX_NEW_PACKET_INT_ENA_V  0x1
#define HOST_FN2_SLC1_BT_RX_NEW_PACKET_INT_ENA_S  25
/* HOST_FN2_SLC1_HOST_RD_RETRY_INT_ENA : R/W ;bitpos:[24] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_SLC1_HOST_RD_RETRY_INT_ENA  (BIT(24))
#define HOST_FN2_SLC1_HOST_RD_RETRY_INT_ENA_M  (BIT(24))
#define HOST_FN2_SLC1_HOST_RD_RETRY_INT_ENA_V  0x1
#define HOST_FN2_SLC1_HOST_RD_RETRY_INT_ENA_S  24
/* HOST_FN2_SLC1_WIFI_RX_NEW_PACKET_INT_ENA : R/W ;bitpos:[23] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_SLC1_WIFI_RX_NEW_PACKET_INT_ENA  (BIT(23))
#define HOST_FN2_SLC1_WIFI_RX_NEW_PACKET_INT_ENA_M  (BIT(23))
#define HOST_FN2_SLC1_WIFI_RX_NEW_PACKET_INT_ENA_V  0x1
#define HOST_FN2_SLC1_WIFI_RX_NEW_PACKET_INT_ENA_S  23
/* HOST_FN2_SLC1_EXT_BIT3_INT_ENA : R/W ;bitpos:[22] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_SLC1_EXT_BIT3_INT_ENA  (BIT(22))
#define HOST_FN2_SLC1_EXT_BIT3_INT_ENA_M  (BIT(22))
#define HOST_FN2_SLC1_EXT_BIT3_INT_ENA_V  0x1
#define HOST_FN2_SLC1_EXT_BIT3_INT_ENA_S  22
/* HOST_FN2_SLC1_EXT_BIT2_INT_ENA : R/W ;bitpos:[21] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_SLC1_EXT_BIT2_INT_ENA  (BIT(21))
#define HOST_FN2_SLC1_EXT_BIT2_INT_ENA_M  (BIT(21))
#define HOST_FN2_SLC1_EXT_BIT2_INT_ENA_V  0x1
#define HOST_FN2_SLC1_EXT_BIT2_INT_ENA_S  21
/* HOST_FN2_SLC1_EXT_BIT1_INT_ENA : R/W ;bitpos:[20] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_SLC1_EXT_BIT1_INT_ENA  (BIT(20))
#define HOST_FN2_SLC1_EXT_BIT1_INT_ENA_M  (BIT(20))
#define HOST_FN2_SLC1_EXT_BIT1_INT_ENA_V  0x1
#define HOST_FN2_SLC1_EXT_BIT1_INT_ENA_S  20
/* HOST_FN2_SLC1_EXT_BIT0_INT_ENA : R/W ;bitpos:[19] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_SLC1_EXT_BIT0_INT_ENA  (BIT(19))
#define HOST_FN2_SLC1_EXT_BIT0_INT_ENA_M  (BIT(19))
#define HOST_FN2_SLC1_EXT_BIT0_INT_ENA_V  0x1
#define HOST_FN2_SLC1_EXT_BIT0_INT_ENA_S  19
/* HOST_FN2_SLC1_RX_PF_VALID_INT_ENA : R/W ;bitpos:[18] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_SLC1_RX_PF_VALID_INT_ENA  (BIT(18))
#define HOST_FN2_SLC1_RX_PF_VALID_INT_ENA_M  (BIT(18))
#define HOST_FN2_SLC1_RX_PF_VALID_INT_ENA_V  0x1
#define HOST_FN2_SLC1_RX_PF_VALID_INT_ENA_S  18
/* HOST_FN2_SLC1_TX_OVF_INT_ENA : R/W ;bitpos:[17] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_SLC1_TX_OVF_INT_ENA  (BIT(17))
#define HOST_FN2_SLC1_TX_OVF_INT_ENA_M  (BIT(17))
#define HOST_FN2_SLC1_TX_OVF_INT_ENA_V  0x1
#define HOST_FN2_SLC1_TX_OVF_INT_ENA_S  17
/* HOST_FN2_SLC1_RX_UDF_INT_ENA : R/W ;bitpos:[16] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_SLC1_RX_UDF_INT_ENA  (BIT(16))
#define HOST_FN2_SLC1_RX_UDF_INT_ENA_M  (BIT(16))
#define HOST_FN2_SLC1_RX_UDF_INT_ENA_V  0x1
#define HOST_FN2_SLC1_RX_UDF_INT_ENA_S  16
/* HOST_FN2_SLC1HOST_TX_START_INT_ENA : R/W ;bitpos:[15] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_SLC1HOST_TX_START_INT_ENA  (BIT(15))
#define HOST_FN2_SLC1HOST_TX_START_INT_ENA_M  (BIT(15))
#define HOST_FN2_SLC1HOST_TX_START_INT_ENA_V  0x1
#define HOST_FN2_SLC1HOST_TX_START_INT_ENA_S  15
/* HOST_FN2_SLC1HOST_RX_START_INT_ENA : R/W ;bitpos:[14] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_SLC1HOST_RX_START_INT_ENA  (BIT(14))
#define HOST_FN2_SLC1HOST_RX_START_INT_ENA_M  (BIT(14))
#define HOST_FN2_SLC1HOST_RX_START_INT_ENA_V  0x1
#define HOST_FN2_SLC1HOST_RX_START_INT_ENA_S  14
/* HOST_FN2_SLC1HOST_RX_EOF_INT_ENA : R/W ;bitpos:[13] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_SLC1HOST_RX_EOF_INT_ENA  (BIT(13))
#define HOST_FN2_SLC1HOST_RX_EOF_INT_ENA_M  (BIT(13))
#define HOST_FN2_SLC1HOST_RX_EOF_INT_ENA_V  0x1
#define HOST_FN2_SLC1HOST_RX_EOF_INT_ENA_S  13
/* HOST_FN2_SLC1HOST_RX_SOF_INT_ENA : R/W ;bitpos:[12] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_SLC1HOST_RX_SOF_INT_ENA  (BIT(12))
#define HOST_FN2_SLC1HOST_RX_SOF_INT_ENA_M  (BIT(12))
#define HOST_FN2_SLC1HOST_RX_SOF_INT_ENA_V  0x1
#define HOST_FN2_SLC1HOST_RX_SOF_INT_ENA_S  12
/* HOST_FN2_SLC1_TOKEN1_0TO1_INT_ENA : R/W ;bitpos:[11] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_SLC1_TOKEN1_0TO1_INT_ENA  (BIT(11))
#define HOST_FN2_SLC1_TOKEN1_0TO1_INT_ENA_M  (BIT(11))
#define HOST_FN2_SLC1_TOKEN1_0TO1_INT_ENA_V  0x1
#define HOST_FN2_SLC1_TOKEN1_0TO1_INT_ENA_S  11
/* HOST_FN2_SLC1_TOKEN0_0TO1_INT_ENA : R/W ;bitpos:[10] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_SLC1_TOKEN0_0TO1_INT_ENA  (BIT(10))
#define HOST_FN2_SLC1_TOKEN0_0TO1_INT_ENA_M  (BIT(10))
#define HOST_FN2_SLC1_TOKEN0_0TO1_INT_ENA_V  0x1
#define HOST_FN2_SLC1_TOKEN0_0TO1_INT_ENA_S  10
/* HOST_FN2_SLC1_TOKEN1_1TO0_INT_ENA : R/W ;bitpos:[9] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_SLC1_TOKEN1_1TO0_INT_ENA  (BIT(9))
#define HOST_FN2_SLC1_TOKEN1_1TO0_INT_ENA_M  (BIT(9))
#define HOST_FN2_SLC1_TOKEN1_1TO0_INT_ENA_V  0x1
#define HOST_FN2_SLC1_TOKEN1_1TO0_INT_ENA_S  9
/* HOST_FN2_SLC1_TOKEN0_1TO0_INT_ENA : R/W ;bitpos:[8] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_SLC1_TOKEN0_1TO0_INT_ENA  (BIT(8))
#define HOST_FN2_SLC1_TOKEN0_1TO0_INT_ENA_M  (BIT(8))
#define HOST_FN2_SLC1_TOKEN0_1TO0_INT_ENA_V  0x1
#define HOST_FN2_SLC1_TOKEN0_1TO0_INT_ENA_S  8
/* HOST_FN2_SLC1_TOHOST_BIT7_INT_ENA : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_SLC1_TOHOST_BIT7_INT_ENA  (BIT(7))
#define HOST_FN2_SLC1_TOHOST_BIT7_INT_ENA_M  (BIT(7))
#define HOST_FN2_SLC1_TOHOST_BIT7_INT_ENA_V  0x1
#define HOST_FN2_SLC1_TOHOST_BIT7_INT_ENA_S  7
/* HOST_FN2_SLC1_TOHOST_BIT6_INT_ENA : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_SLC1_TOHOST_BIT6_INT_ENA  (BIT(6))
#define HOST_FN2_SLC1_TOHOST_BIT6_INT_ENA_M  (BIT(6))
#define HOST_FN2_SLC1_TOHOST_BIT6_INT_ENA_V  0x1
#define HOST_FN2_SLC1_TOHOST_BIT6_INT_ENA_S  6
/* HOST_FN2_SLC1_TOHOST_BIT5_INT_ENA : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_SLC1_TOHOST_BIT5_INT_ENA  (BIT(5))
#define HOST_FN2_SLC1_TOHOST_BIT5_INT_ENA_M  (BIT(5))
#define HOST_FN2_SLC1_TOHOST_BIT5_INT_ENA_V  0x1
#define HOST_FN2_SLC1_TOHOST_BIT5_INT_ENA_S  5
/* HOST_FN2_SLC1_TOHOST_BIT4_INT_ENA : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_SLC1_TOHOST_BIT4_INT_ENA  (BIT(4))
#define HOST_FN2_SLC1_TOHOST_BIT4_INT_ENA_M  (BIT(4))
#define HOST_FN2_SLC1_TOHOST_BIT4_INT_ENA_V  0x1
#define HOST_FN2_SLC1_TOHOST_BIT4_INT_ENA_S  4
/* HOST_FN2_SLC1_TOHOST_BIT3_INT_ENA : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_SLC1_TOHOST_BIT3_INT_ENA  (BIT(3))
#define HOST_FN2_SLC1_TOHOST_BIT3_INT_ENA_M  (BIT(3))
#define HOST_FN2_SLC1_TOHOST_BIT3_INT_ENA_V  0x1
#define HOST_FN2_SLC1_TOHOST_BIT3_INT_ENA_S  3
/* HOST_FN2_SLC1_TOHOST_BIT2_INT_ENA : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_SLC1_TOHOST_BIT2_INT_ENA  (BIT(2))
#define HOST_FN2_SLC1_TOHOST_BIT2_INT_ENA_M  (BIT(2))
#define HOST_FN2_SLC1_TOHOST_BIT2_INT_ENA_V  0x1
#define HOST_FN2_SLC1_TOHOST_BIT2_INT_ENA_S  2
/* HOST_FN2_SLC1_TOHOST_BIT1_INT_ENA : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_SLC1_TOHOST_BIT1_INT_ENA  (BIT(1))
#define HOST_FN2_SLC1_TOHOST_BIT1_INT_ENA_M  (BIT(1))
#define HOST_FN2_SLC1_TOHOST_BIT1_INT_ENA_V  0x1
#define HOST_FN2_SLC1_TOHOST_BIT1_INT_ENA_S  1
/* HOST_FN2_SLC1_TOHOST_BIT0_INT_ENA : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define HOST_FN2_SLC1_TOHOST_BIT0_INT_ENA  (BIT(0))
#define HOST_FN2_SLC1_TOHOST_BIT0_INT_ENA_M  (BIT(0))
#define HOST_FN2_SLC1_TOHOST_BIT0_INT_ENA_V  0x1
#define HOST_FN2_SLC1_TOHOST_BIT0_INT_ENA_S  0

#define HOST_SLC0HOST_INT_ENA_REG          (DR_REG_SLCHOST_BASE + 0xEC)
/* HOST_GPIO_SDIO_INT_ENA : R/W ;bitpos:[25] ;default: 1'b0 ; */
/*description: */
#define HOST_GPIO_SDIO_INT_ENA  (BIT(25))
#define HOST_GPIO_SDIO_INT_ENA_M  (BIT(25))
#define HOST_GPIO_SDIO_INT_ENA_V  0x1
#define HOST_GPIO_SDIO_INT_ENA_S  25
/* HOST_SLC0_HOST_RD_RETRY_INT_ENA : R/W ;bitpos:[24] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_HOST_RD_RETRY_INT_ENA  (BIT(24))
#define HOST_SLC0_HOST_RD_RETRY_INT_ENA_M  (BIT(24))
#define HOST_SLC0_HOST_RD_RETRY_INT_ENA_V  0x1
#define HOST_SLC0_HOST_RD_RETRY_INT_ENA_S  24
/* HOST_SLC0_RX_NEW_PACKET_INT_ENA : R/W ;bitpos:[23] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_RX_NEW_PACKET_INT_ENA  (BIT(23))
#define HOST_SLC0_RX_NEW_PACKET_INT_ENA_M  (BIT(23))
#define HOST_SLC0_RX_NEW_PACKET_INT_ENA_V  0x1
#define HOST_SLC0_RX_NEW_PACKET_INT_ENA_S  23
/* HOST_SLC0_EXT_BIT3_INT_ENA : R/W ;bitpos:[22] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_EXT_BIT3_INT_ENA  (BIT(22))
#define HOST_SLC0_EXT_BIT3_INT_ENA_M  (BIT(22))
#define HOST_SLC0_EXT_BIT3_INT_ENA_V  0x1
#define HOST_SLC0_EXT_BIT3_INT_ENA_S  22
/* HOST_SLC0_EXT_BIT2_INT_ENA : R/W ;bitpos:[21] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_EXT_BIT2_INT_ENA  (BIT(21))
#define HOST_SLC0_EXT_BIT2_INT_ENA_M  (BIT(21))
#define HOST_SLC0_EXT_BIT2_INT_ENA_V  0x1
#define HOST_SLC0_EXT_BIT2_INT_ENA_S  21
/* HOST_SLC0_EXT_BIT1_INT_ENA : R/W ;bitpos:[20] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_EXT_BIT1_INT_ENA  (BIT(20))
#define HOST_SLC0_EXT_BIT1_INT_ENA_M  (BIT(20))
#define HOST_SLC0_EXT_BIT1_INT_ENA_V  0x1
#define HOST_SLC0_EXT_BIT1_INT_ENA_S  20
/* HOST_SLC0_EXT_BIT0_INT_ENA : R/W ;bitpos:[19] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_EXT_BIT0_INT_ENA  (BIT(19))
#define HOST_SLC0_EXT_BIT0_INT_ENA_M  (BIT(19))
#define HOST_SLC0_EXT_BIT0_INT_ENA_V  0x1
#define HOST_SLC0_EXT_BIT0_INT_ENA_S  19
/* HOST_SLC0_RX_PF_VALID_INT_ENA : R/W ;bitpos:[18] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_RX_PF_VALID_INT_ENA  (BIT(18))
#define HOST_SLC0_RX_PF_VALID_INT_ENA_M  (BIT(18))
#define HOST_SLC0_RX_PF_VALID_INT_ENA_V  0x1
#define HOST_SLC0_RX_PF_VALID_INT_ENA_S  18
/* HOST_SLC0_TX_OVF_INT_ENA : R/W ;bitpos:[17] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TX_OVF_INT_ENA  (BIT(17))
#define HOST_SLC0_TX_OVF_INT_ENA_M  (BIT(17))
#define HOST_SLC0_TX_OVF_INT_ENA_V  0x1
#define HOST_SLC0_TX_OVF_INT_ENA_S  17
/* HOST_SLC0_RX_UDF_INT_ENA : R/W ;bitpos:[16] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_RX_UDF_INT_ENA  (BIT(16))
#define HOST_SLC0_RX_UDF_INT_ENA_M  (BIT(16))
#define HOST_SLC0_RX_UDF_INT_ENA_V  0x1
#define HOST_SLC0_RX_UDF_INT_ENA_S  16
/* HOST_SLC0HOST_TX_START_INT_ENA : R/W ;bitpos:[15] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0HOST_TX_START_INT_ENA  (BIT(15))
#define HOST_SLC0HOST_TX_START_INT_ENA_M  (BIT(15))
#define HOST_SLC0HOST_TX_START_INT_ENA_V  0x1
#define HOST_SLC0HOST_TX_START_INT_ENA_S  15
/* HOST_SLC0HOST_RX_START_INT_ENA : R/W ;bitpos:[14] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0HOST_RX_START_INT_ENA  (BIT(14))
#define HOST_SLC0HOST_RX_START_INT_ENA_M  (BIT(14))
#define HOST_SLC0HOST_RX_START_INT_ENA_V  0x1
#define HOST_SLC0HOST_RX_START_INT_ENA_S  14
/* HOST_SLC0HOST_RX_EOF_INT_ENA : R/W ;bitpos:[13] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0HOST_RX_EOF_INT_ENA  (BIT(13))
#define HOST_SLC0HOST_RX_EOF_INT_ENA_M  (BIT(13))
#define HOST_SLC0HOST_RX_EOF_INT_ENA_V  0x1
#define HOST_SLC0HOST_RX_EOF_INT_ENA_S  13
/* HOST_SLC0HOST_RX_SOF_INT_ENA : R/W ;bitpos:[12] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0HOST_RX_SOF_INT_ENA  (BIT(12))
#define HOST_SLC0HOST_RX_SOF_INT_ENA_M  (BIT(12))
#define HOST_SLC0HOST_RX_SOF_INT_ENA_V  0x1
#define HOST_SLC0HOST_RX_SOF_INT_ENA_S  12
/* HOST_SLC0_TOKEN1_0TO1_INT_ENA : R/W ;bitpos:[11] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOKEN1_0TO1_INT_ENA  (BIT(11))
#define HOST_SLC0_TOKEN1_0TO1_INT_ENA_M  (BIT(11))
#define HOST_SLC0_TOKEN1_0TO1_INT_ENA_V  0x1
#define HOST_SLC0_TOKEN1_0TO1_INT_ENA_S  11
/* HOST_SLC0_TOKEN0_0TO1_INT_ENA : R/W ;bitpos:[10] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOKEN0_0TO1_INT_ENA  (BIT(10))
#define HOST_SLC0_TOKEN0_0TO1_INT_ENA_M  (BIT(10))
#define HOST_SLC0_TOKEN0_0TO1_INT_ENA_V  0x1
#define HOST_SLC0_TOKEN0_0TO1_INT_ENA_S  10
/* HOST_SLC0_TOKEN1_1TO0_INT_ENA : R/W ;bitpos:[9] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOKEN1_1TO0_INT_ENA  (BIT(9))
#define HOST_SLC0_TOKEN1_1TO0_INT_ENA_M  (BIT(9))
#define HOST_SLC0_TOKEN1_1TO0_INT_ENA_V  0x1
#define HOST_SLC0_TOKEN1_1TO0_INT_ENA_S  9
/* HOST_SLC0_TOKEN0_1TO0_INT_ENA : R/W ;bitpos:[8] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOKEN0_1TO0_INT_ENA  (BIT(8))
#define HOST_SLC0_TOKEN0_1TO0_INT_ENA_M  (BIT(8))
#define HOST_SLC0_TOKEN0_1TO0_INT_ENA_V  0x1
#define HOST_SLC0_TOKEN0_1TO0_INT_ENA_S  8
/* HOST_SLC0_TOHOST_BIT7_INT_ENA : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOHOST_BIT7_INT_ENA  (BIT(7))
#define HOST_SLC0_TOHOST_BIT7_INT_ENA_M  (BIT(7))
#define HOST_SLC0_TOHOST_BIT7_INT_ENA_V  0x1
#define HOST_SLC0_TOHOST_BIT7_INT_ENA_S  7
/* HOST_SLC0_TOHOST_BIT6_INT_ENA : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOHOST_BIT6_INT_ENA  (BIT(6))
#define HOST_SLC0_TOHOST_BIT6_INT_ENA_M  (BIT(6))
#define HOST_SLC0_TOHOST_BIT6_INT_ENA_V  0x1
#define HOST_SLC0_TOHOST_BIT6_INT_ENA_S  6
/* HOST_SLC0_TOHOST_BIT5_INT_ENA : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOHOST_BIT5_INT_ENA  (BIT(5))
#define HOST_SLC0_TOHOST_BIT5_INT_ENA_M  (BIT(5))
#define HOST_SLC0_TOHOST_BIT5_INT_ENA_V  0x1
#define HOST_SLC0_TOHOST_BIT5_INT_ENA_S  5
/* HOST_SLC0_TOHOST_BIT4_INT_ENA : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOHOST_BIT4_INT_ENA  (BIT(4))
#define HOST_SLC0_TOHOST_BIT4_INT_ENA_M  (BIT(4))
#define HOST_SLC0_TOHOST_BIT4_INT_ENA_V  0x1
#define HOST_SLC0_TOHOST_BIT4_INT_ENA_S  4
/* HOST_SLC0_TOHOST_BIT3_INT_ENA : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOHOST_BIT3_INT_ENA  (BIT(3))
#define HOST_SLC0_TOHOST_BIT3_INT_ENA_M  (BIT(3))
#define HOST_SLC0_TOHOST_BIT3_INT_ENA_V  0x1
#define HOST_SLC0_TOHOST_BIT3_INT_ENA_S  3
/* HOST_SLC0_TOHOST_BIT2_INT_ENA : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOHOST_BIT2_INT_ENA  (BIT(2))
#define HOST_SLC0_TOHOST_BIT2_INT_ENA_M  (BIT(2))
#define HOST_SLC0_TOHOST_BIT2_INT_ENA_V  0x1
#define HOST_SLC0_TOHOST_BIT2_INT_ENA_S  2
/* HOST_SLC0_TOHOST_BIT1_INT_ENA : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOHOST_BIT1_INT_ENA  (BIT(1))
#define HOST_SLC0_TOHOST_BIT1_INT_ENA_M  (BIT(1))
#define HOST_SLC0_TOHOST_BIT1_INT_ENA_V  0x1
#define HOST_SLC0_TOHOST_BIT1_INT_ENA_S  1
/* HOST_SLC0_TOHOST_BIT0_INT_ENA : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOHOST_BIT0_INT_ENA  (BIT(0))
#define HOST_SLC0_TOHOST_BIT0_INT_ENA_M  (BIT(0))
#define HOST_SLC0_TOHOST_BIT0_INT_ENA_V  0x1
#define HOST_SLC0_TOHOST_BIT0_INT_ENA_S  0

